{
  "intro": {
    "description": "Full-Stack Developer | Passionate About Software Development."
  },
  "about": {
    "description": "I am a Full-Stack Developer from Tunisia, with a solid background in computer science and engineering from ESPRIT. My journey into software development began with a deep interest in coding languages such as JavaScript, Java, and Python, which I have honed alongside frameworks like ReactJS, Angular, and SpringBoot. I thrive on creating intuitive user experiences and delving into the latest frontend and backend technologies. Always eager to learn and grow, I continuously seek new skills and explore various aspects of design and development."
  },
  "skills": [
    "JavaScript",
    "Java",
    "TypeScript",
    "Node.js",
    "HTML",
    "CSS",
    "ReactJS",
    "ExpressJS",
    "SpringBoot",
    "J2EE",
    "Angular",
    "MySQL",
    "MongoDB",
    "PostgreSQL",
    "OracleDB",
    "Git",
    "Jenkins",
    "Openshift",
    "Docker",
    "Grafana"
  ],
  "certifications": [
    {
      "name": "AWS Certified Cloud Practitioner",
      "badge": "certifications/AWSCP.png",
      "link": "https://www.credly.com/badges/2cd113bc-9fa6-40a2-8d6c-f52f47d86187/linked_in_profile"
    },
    {
      "name": "Oracle Database SQL Certified Associate",
      "badge": "certifications/OCASQL12C.png",
      "link": "https://catalog-education.oracle.com/ords/certview/sharebadge?id=3EC153068BC00BADC6B54811A58641C2FC9C281A5EB08FEABFA5D6AD85FAB8A7"
    },
    {
      "name": "Oracle Certified Professional: Java SE 21 Developer",
      "badge": "certifications/JSE21OCP.png",
      "link": "https://catalog-education.oracle.com/ords/certview/sharebadge?id=9E1E2B9F11B69FBE7E4008020DCC852E4D7309A0B51AF7ED411AF6288CD7DA6C"
    }
  ],
  "socials": {
    "email": "moetez22@gmail.com",
    "linkedin": "https://www.linkedin.com/in/moetez-ayari-22b1031b2/",
    "github": "https://github.com/moetez96"
  },
  "experiences": [
    {
      "title": "Deloitte Tunisia",
      "date": "October 2022 – Present",
      "projects": [
        {
          "projectName": "BMW Damage Management Application",
          "role": "Full Stack Developer",
          "technologies": "Angular, Spring Boot, Java 11, Node JS, PostgreSQL, Docker, Jenkins, AWS S3, Bitbucket",
          "description": "I contributed to the development of a web application for managing vehicle damage during transportation, assisting in the migration from a monolithic architecture to a microservices-based system. I enhanced the UI to improve user experience and functionality, while also designing and developing reusable components in Angular. In addition, I optimized the performance of frequently used database queries and gained valuable experience in both back-end and front-end development within a collaborative team environment."
        },
        {
          "projectName": "Tunisie Telecom BSCS",
          "role": "Full Stack Developer",
          "technologies": "Angular, Spring Boot, J2EE, Microservices, Jenkins, OracleDB, SQL, Docker, OpenShift, Grafana.",
          "description": "I developed and maintained various components of the Billing System for a telecom operator, collaborating on the design and development of new microservices using Spring Boot. I migrated SOAP web services to RESTful APIs within a microservices architecture and implemented an OpenShift Logging Cluster while integrating Grafana for real-time monitoring and log visualization. Additionally, I integrated CI/CD pipelines with Jenkins to streamline deployment and testing processes, and I designed and optimized new and existing UI components to enhance system performance and usability."
        }
      ]
    },
    {
      "title": "Orange Digital Center",
      "date": "February 2022- August 2022",
      "projects": [
        {
          "projectName": "Candidates Sourcing Website",
          "role": "End of Study Internship",
          "technologies": "Node.js, React.js, GitHub, MongoDB, Next.js, Express.js",
          "description": "Development of a candidates sourcing website that aims to offer enterprises a more fleshed out image of their potential candidates, and open new opportunities for candidates to better reach new recruiters."
        }
      ]
    },
    {
      "title": "ESPRIT TECH RDI",
      "date": "July 2021- August 2021",
      "projects": [
        {
          "projectName": "Personalized E-Learning Platform",
          "role": "Summer Internship",
          "technologies": "MongoDB, Spring Boot, Angular",
          "description": "Development of a personalized E-Learning platform that aims to provide users with specific courses related to their fields of specialization."
        }
      ]
    },
    {
      "title": "ISI KEF",
      "date": "January 2019 – June 2019",
      "projects": [
        {
          "projectName": "University Events Mobile Application",
          "role": "End of Study Internship",
          "technologies": "Android Studio, Firebase",
          "description": "Development of a mobile application for university events, courses and forums."
        }
      ]
    },
    {
      "title": "Cryptec",
      "date": "June 2018 – August 2018",
      "projects": [
        {
          "projectName": "Management Desktop Application",
          "role": "Summer Internship",
          "technologies": "VB.NET, SQL",
          "description": "Development of a management Desktop application for employees schedules and machines dysfunctions in the workspace."
        }
      ]
    }
  ],
  "projects": {
    "description": "Here are some of the selected projects that showcase my passion for software development.",
    "list": [
      {
        "id": 1,
        "name": "chat-app",
        "title": "Chat App",
        "description": "A messaging application built with Angular and SpringBoot, that allows users to register, log in, search for new friends, send and manage friendship requests, and chat in real-time with other users.",
        "features": [
          "User Registration and Login: Secure registration and login using JWT-based authentication.",
          "Search Friends: Users can search for other users by username.",
          "Friendship Requests: Send, accept, and manage friendship requests.",
          "Chat: Engage in real-time one-on-one messaging with friends.",
          "Real-time Notifications: Receive real-time notifications for new messages, friend requests, and online/offline.",
          "Responsive Design: Fully responsive design, ensuring smooth functionality across desktops, tablets, and mobile devices."
        ],
        "technologies": [
          "Spring Boot",
          "Angular"
        ],
        "demo": "https://chat-app-rust-phi.vercel.app/",
        "sourceFrontend": "https://github.com/moetez96/chat-app",
        "sourceBacked": "https://github.com/moetez96/chat-api",
        "imgPlaceholder": "chatapp.png"
      },
      {
        "id": 2,
        "name": "music-player-app",
        "title": "Music Player App",
        "description": "A modern, responsive music player app built with React and Sass, utilizing IndexedDB (via LocalBase) for local storage. This app allows users to select and play audio files from their device.\n\nUsers can scan specific folders for audio files, collect metadata, and manage their music library with ease.",
        "features": [
          "File Selection & Scanning: Users can select individual audio files from their device or scan entire folders (including subfolders) for audio files.",
          "Metadata Collection: Automatically collects and displays metadata for each audio file.",
          "Favorites: Users can mark tracks as favorites for easy access.",
          "Playback Modes: Includes repeat, play all, and shuffle modes.",
          "Search: Users can search for audio files within their library.",
          "Volume Control: Users can adjust the playback volume.",
          "Music Slider: Users can control the playback progress with a slider.",
          "Track Navigation: Allows jumping to the next or previous track if available.",
          "Responsive Design: Optimized for both desktop and mobile devices."
        ],
        "technologies": [
          "React",
          "IndexedDB (LocalBase)"
        ],
        "demo": "https://music-player-app-blond.vercel.app/",
        "source": "https://github.com/moetez96/music-player-app",
        "imgPlaceholder": "musicapppic.png"
      },
      {
        "id": 3,
        "name": "university-enrollment",
        "title": "University Enrollement",
        "description": "University Enrollement is a monolithic web application that allows students to register, login and enroll in available courses.",
        "features": [
          "User Registration and Login: Students can create accounts with their personal information and login.",
          "Course Catalog & Programs: A list of available courses and programs",
          "Course Enrollment: Students can select courses they wish to enroll in.",
          "Student Scores: Students can view all Students Learner Profiles, Sorted by GPA.",
          "User Profile Management: Ability for students to update personal information, view enrolled courses, and manage their courses."
        ],
        "technologies": [
          "Spring Boot",
          "Thymleaf"
        ],
        "demo": "https://university-enrollement.onrender.com",
        "source": "https://github.com/moetez96/university-enrollement",
        "imgPlaceholder": "universityapppic.png"
      }
    ]
  }
}